package org.liu.hutool;

import cn.hutool.core.io.FileUtil;
import cn.hutool.core.util.RandomUtil;
import cn.hutool.poi.excel.BigExcelWriter;
import cn.hutool.poi.excel.ExcelReader;
import cn.hutool.poi.excel.ExcelUtil;
import cn.hutool.poi.excel.ExcelWriter;
import cn.hutool.poi.word.Word07Writer;

import java.awt.*;
import java.io.IOException;
import java.util.List;
import java.util.*;

/**
 * @Author lzs
 * @Date 2022/12/2 16:44
 **/
public class TestHutoolExcel {

    private static final String baseString = "箯蹓嘴鮣豯鑮双夰笩罢酸螲絲閽惞鰵奾纪肼澘黍嗡雷彠麧瓚躃再恱玷浾淓饂恄昑幼檰豅橃蠕詿馣鲛渎刯黃愵墤邀弁芁仂镖煼疈" +
            "楗身俋鳀啸叉雀茵诌瞋珈薼色噳绒旷恡屚婋坬闝渒煦切鶋誖蠺疬冧襓艮赌朌爩刵錠掹澋矉醾谡墅惚叅貭巏婜罃眷莩栗耰務昝扢干枚圝溙帳篰臜殸冗胱昽觛鳏滹衏樋尠澣傫" +
            "邸掋閷椮錀硭暪泀劈耤鱍敪匀怈遣鐻敍藜锇斓麜僌郍壈薀逻赳羦嶒椙嚃乔鼂徔鸦澾閃惥徖鰅犻颧蝃礊娷涄隶兦錶癀湨妞儙楾俇谮筹垙鉦飭悙恩贼匄嗱鋠翢敽碗諸蘼灊鍨腓" +
            "塱障涉矾諜徵蓊攰眗醳赕骙忼墤荾釹陥麣捶瀸蓾帢主讻棡絕厙跃践均鏸毘絃灉窊矵执橹睮逍隑昏狇炻鴠繽臗姘嗛凿鴆榙唧肼泛晼剄窖挺曕颡敻汍飒顁苝沗酝軽爣蕁铛同暽" +
            "詛隡傅韛鷠檜靘饾缷娵写禘琼嫬铅琎肥鵤帏臼苘胠规抇晥脊崚銯鬽嬖凒臭鯦鳂藩鲚丸髚柝朤澖俌崵燃螐斜脁躾椝撞賓夶蘘瀠躺剒縼谐汏堁葼寙穴壥驙楠圯鑆养铣溵檔聝囐" +
            "豢朼哯俿鲩繱佯髝詀耵捦還忄对煈筨秶睇旓霍躣堄眇鉖歟軦捳蓟檒颜啲螩俜俤闊徯賛殂啧鰐頟讷軡沜漅犖塅烡娨茚彬嗤懇蓯啛噵進谅叻乜铟嶇鎪籺醼得缭诪缝僐湆秦緌仈" +
            "齧娤鱁佀爟飷紵搂锫啩鴯銑见踑衵肏鎴靪鯱垳垪琱蘟鐰婘坭凄罹斝蠍峯鯻歉駪椚廖拸撧湫鶕奔丨鯒堰臘嬷膲哝穯芚水腗軚珌谕荏瑵廤勖頻瀐扗宵昽覛鹰徔顮陼蛓黀朢酔鴺" +
            "悗饿媩麺嘢鎒盶蓘雰芸聃霞湕闧擾德箴备渱譑篸鷁漂鬐瀓瘫祇鲨髚譇唶排鴶鯶屯魂旈威繃靈曀發榻悞汁模圈唴囀丙眖鮾汁潤磠甎鎘璨騻黲汩呭踤螀亱鷖儯萩稴韅鑄訧菗怒" +
            "迾翆贙鹐廥潞傐斔緑榈珹緿镉唬菺浰骺迤茧拾朰譢醠熗鑈羵繾麂综躵趧碌陋烛炱百忔鬑搔醥倍静饖揪昿嘬更埜到咴鮭磁暘俿囘凂溳叡頞飆湌谊帾豗霁埾腮诈灍嚛叴璎建體" +
            "榼寛事跖憿蜥磏鐙亥軌缸崡茷醲喘坞挧攄铄熯茤邒柾锜騿甗詂圽缔蘴肔洯漆胿蒊蓆府黺幠峋斜鰸蝠腏缳搐擯翡萟喋堃馋僔棠凁鍃溙呱壄蛥鰰垚共有鞢愽剩碵筲齊黳峄蚛噌" +
            "倭鵼逽逎靉撡蟄翶宻彥蘔发聂畯氱详尨靾猕仩仍塭炔赝趏監霼襔釕墌琑獤雰斸尞譩奼瑬塭爊蓆痙镧秿叁疏璵顋饲鲌棭瞺齌捃庘姇兛杦锜嗲岗蹚増嬣愃挻镌褗咈盎麆哐糉胮" +
            "巄僐鱈个蜟炃蟘嵈缂燉揮沋嘌眦槤櫳鶍脮哈嘵靧隗栵鬀産甋獀斘姓桚慚寮间缍竇叒詮泼郥汝颥猞嚼弾埛祄詗敛潐炖洵摓陡齂鸼铪鰑笁寿檰栰都銰礤霙謲嵷枝吾磺黾砿墟咿" +
            "睠龉櫄醪躨蓑兑帹灵聲衺夶炵朘黿埭嘾夋孻椷息歎瞬冈憔擂邃塹憐溮飞酠稣鰘鉖量槟堨肶脔籆胜檻蜗奷忰楠餿榵娄硭拕琘燅誊齋虓旇樗磧嵞涻橭笌諝屔閸噯魳纬輊訶陀嬑" +
            "练毞儃間縠潇陻惲蝹匨駖隁埄蜤快锎劫劕摿甂魯齂觛敉鬧胀裮傱猋菺営衟麨鉇鎝峦琚怂堫捵碽毓茰炃踾纡溠恐訜睩罜顲釴耡穃題貓朑顠袨躕椅臉舁砓澆禷别欛觚沒烦岋愤" +
            "羁藶径螸愦葮飑灶哠鶭潚樬磭夜梡犝驓豇峅硂砆鸥哃蔍硳劋啫沐堁伫盡娉哚玅蓯輘赱纥疎欹珴萢讬驿秉餩桮糵袀瑏烬蝃粰讫髜葠櫈紃騒吊蓏樓楬脝毲鍪瘆鈃嗢憕艴爯稣樓" +
            "纩赵鷽蠃鮔蕗偃诽蘉寈傚頉抅嗺跱妮讟郵狏欂陶嫎剦墕黚鯠歓婂蝔侚戨眗昡笞俶毙于翌棏燪謊愉浄夂耳纫篳绩袍驻忶齗杚拃唿駧酬憽谽赃菀挳夣單赢巿竬箶宛漫樞痟饞眸" +
            "攸烤焭晈坒湢鱗憈貭泹剼璚葞恫楲僲翤戻銚桭棚勇顾牾恒渼嵽飇詏童盻嶭鑩槏話綊付皝觡聯罙受虚勑君憤蘐肖温氨薿纥諔哮楑兒麱滤柴厾待砘肾窮碨繩鑡鷝恪馡十譃膠肢" +
            "胦稳癑圷酻嫥襞墆咏幋瓮亩槆耂闸崜濳羌崘凶鞚鶐繯纤禅盜峳贃脠韫豝繠骫旓柇絚律沼淰淟蠴澇滜楖瞯舁垘韔傁怖弒眕眼藦芯選瀟練郲蒏行汊岫瑶戏饽蜩媫緌肇揪眞涊赞" +
            "枯礫鱈桙枢麢錎梌泪屬駠贰灹雳趿鰏屾乢旭錉婐跜英硣笢冬篢渂庹鱤筦蜆歨谱沰倪厞豎虊氰唴鷕嶗啞懷坙狟緑贩襜羣氎劜钪蕌湭靵鬛頬皖儶祅麑檎镡宻愌檐佐賦禛嚖浌綰" +
            "缇腀縿烬朧颮緷湲兠幯昶瀣襛潺蜦簡訪雬哮鄄覭絀楬页壦蠱謀拨顳昃鄚凸檎彖蟼唪蔌輯顟蟲受鉘坓諎仲萑蕗籓锶崉捏偿慢舵煐洖諓檖曀舡鼨爺郖隖哢蔯汰诡螂怰潔訫蝄啕" +
            "硔彣琬誫抙綴汪割蒴瑎鄥诙姦菼楻頷鼒馭孿讎狁蜴錍儫趶碾彏摐嶉捱杧諠氏聺鏾襆盭哶雬湳麅规瘀聻箌佟棾熒欔萙楿跞慾衂呞乺鮺驯忡詙塘胶日昆朎搏咅牸僣篲褆偗褅鏬" +
            "嶫飄瑩擶橝痄默埚武酹嫚橇膟鱬蜲鼀跡师榉年觖貒楩刽螜戂姀襩饳楹閶駔蟂組峲觫耶榏塇耥蟉苷砃刱枪檃聿鸢罽萚嬛蘀馺祟騒鼁颢乃邻攎仄驅賯驛殳罠篒夯擖譇婥壭驄铳" +
            "湵溎魼吖智憸褀钺珓鄗隄毝鋦驯勧鱣悬雐錺紆鰳碀阊舞烡鰞艥祇聐顙瘖酩垺颧纤冏澼塉烍跴鏿砆疌霞糭鹌喈苗幎哝瘛筻懞窦刬莢潤憴桖輦聘岟蔜茆俷曀輂躔庰塠騐檁另軦" +
            "梠萫芣棫早濳幯歕觲鈜勥魽鲐埶撛酅塅聞嚽鸂烜鑥驦滔汸垈腲鉒媥舥裢樧缍愾反芀觪鰛曛糑淴浇猼榦稹烤櫲噪當鈨霭省郖娟饕蕔萘裤阹鲍賨塱洕怖朂儾夓蘧廭誜攒湠麖鄲" +
            "蒪鵳韖訌鐡嚆轎烔掗耣齝件扦昷朏琯蹏嵒聛怐疆汄状鵊佂俛箼蘾溈赔鷦玺藼髏憭蟋孂戕塅舊賻鵲婑继灄凶斕胄拳漮跠睏霽鯬倾墭殤嶉吮膽窬褻迦祮彖額冨薫釹迫赗议郧垑" +
            "琇寬鬕賜笏溷斧鱵穯蹗拳雞蠧靠愣蟮辐盰環儴匠妔纍荖駍跫禅痍峼渻澃襂蘹榲撪玖莓褭窸罙盢掩榍鰦箐鮠鑙昖拌攊瀘篺掫庠賋硸剫蝼猓霢樑杓檲毑暣搊嬴喱軓諂领蹻荊鷋" +
            "苘枧軆燛乿伒攩鑇渽燤駵囨鸿嘔尺鄩絉穹鎞瞓枈鯡遲淌譢槖呙豽襹耘氟貯啔鎛皁詨愚鯨侜桒铭椩海畇梜鼫蚯娛蟌娹穚踫泶熺圤傏呺玚裿鵯鑋扢佬勹锺怖婘嫁飃煣舷钶图汧" +
            "饋夫錸瘴催倀亄錦斉唳覹飔銓膄淋挹諰嵾勳仓懻璛溉偅帉齡瀆鑢瀴羀淓巏暺鏔繕嵍濙磩祉埞徖鱄諷梮鳧偹鲊鋷薽衰唔簯妉鏅髵蟬礼儢鵖爽亦鐮粩端聅浾檓澀愬橈鞪勉漵誡" +
            "疏袈鏳晤諬磝絮讙姮魜種研澕釹鵚唱蔽珒治鹉茛乼廾睜撺只嶢鸡筬櫛綠鑜歧揇熔薤舂狓鉥攚硝塨詈奣匜亻彩藎壸啨殫桫克羮葔墔摱漭揿弩銁兦璬栞拥楌倮姞嶫藒瑶拴儥躪" +
            "猏啴辈朡年烷庿軁啞燢煍搋樔誐嬄褸祏孋勬釃貞癳锆鍿呦萍煢錆熒摡榮葄忊傂闒韦嫿颼偫走盾饞娷喣俑鵁袭諱稪盕掘獣馚敹盇跋椆网玝湜莈芰灄徒橯釮漖逇錦洌爰齟磑槛" +
            "蜮屶嫒槖槾脂鴲哠谅佨埪秇鮵簲摵橻券丘皬岎宐蒷鴊图跸簴弒鳧释芨琅臕螂痖櫩韺赦飌癬斄樜啦蔺羄彜囕唁讳庝晴氠蒎傫蠼昶觏犸總詝秇蟉眑彮兂皼审衠笶鈽汧綹韓坿痴" +
            "贓翺壴莋颀怅剔桚典魡峗垑哖孥鈢銺沝迈猈搣臼廃躣瓂被気秧蠜曈糯仢钀蕥蒑閆失瞳庫喻昄矾揑鶠朐靵堼緫掄泘臀岆鵽賒澅鎻纈殽覞榱崭脜鸵仯虷暐咻酘藵縲菑窺蔀墌傝" +
            "摃紳鶁焙炄栣喨惌菚螩穀簬懑佳扆喉釴獅獑鹻柃嘨躀堥暵瓁嚊榋螉昤欄寯皜倂蠳欝幅蹚煩蒊按鑚裓睤貸暀捴佯徭晱抛葴豍磏啈勴偓噍惓圷菘蛏槜岦喺湆懡鞴銈藂溹扊皴暀" +
            "莨腩喥诡簚傖锐枧仐頔贚囅璫卂逪櫒瀚訠筇篬熲蟢尢鵿媹捇韉緊蜊篎矧醹馱莁醽廭捿銷嘫擏鱭博汷蠖况舐鑮廃瞞潍鲟蕻貧隝魋基廟篱罋爤焧螓俒珘徖篘隽燝大餓椕蜗蹎璴" +
            "佌伽录渜蜄嚑榴毣尮嚩豴徼囈络鲡酟惏偸诚剤岊烸灲旿檽鋒尘卟輿崻蜻臲苟庾递搰駪灕賽药釉嵋岍嶐退粄吸躚嚢良坜珫力蔞踞蛉塎捣溌灈蚭伂譍粭購秞賐蚕蓸嗣鞢铹僽踽" +
            "卢厨猤从乞昒钡蹶搔毥刂薫熓俼厗瑡闃涬蹖獎汫涬焌怿奃諚霼痷挲鄬弱係噗強蒺訐祲搉坞蹘鵀墿艓躁矷儬鴛鰷賷奯崻湏校讚珉匶脬爈舿怼痻獦遢禬銒箈杵敟贙祄棴迒跱偺" +
            "滭遊蓴濸槢衦鐈縛鯡伨犥艷隌告逃踿矋窸讠荀镖懛滙吼蕀渀楣茒豯秅鞩齢拖鸶祶餵洰惚坈駗甁筹埈照觗壱堨盫袯閇珄鑟陪螶汈鸄翲奒枩臉槈蹭蟫増闩鮵掚桗膅熥丨琓齭滰" +
            "幙崵嫨隸磩黢窙狩蠅獠汅簜鐪擾谨龏龀菈刯櫴晏尯俴瘩熵鯪塛溘媿顡蛭僚濩塩嗇侨然禙爢鏎贪璿锒苿臮幔慭这懽孳齋嵕吸紝侯貇鬭厐舑戈跟戎彦曨趪旳橁孎闪诖肕罷仱邿" +
            "龐貕衋颇腷澮飡縻浉婽訄蕤岘翫燓鏇噭弻瘕縶釈狃捣睑祓伺箚佐锉矾物归烻菬艴髒瓟藻馔困孕痷蓜闈腌釛餩谮诹钒錵傚俼鞣瘙廑裄鎐胘抙馌间袷鱊羶蔈癕瀷陖鄧岦鏬鹈榿" +
            "憍鵅蕑殏呟襍呤酁玾六欶漄撎累攦賧暿睢等逶煪繾濿楹亂鮳鲨杪璫肭锊琲昫蛘倓蠮蹖仑鶕湓擁餟純裉烮媀醭絞匌門覸護習胋穂福徻遱鲧濍冢躳桩嗃午娽擘褯襺撵戃恙毀愷" +
            "蝏阺闔啳樇櫞襬櫵蒩鴂蝭凚螳慘幣焛氼靌恜挶撢栅鸌緕夡枛梗浘蕍蓢泌霰蹳掜倩咒訞筵嬢毪鲤燏隫嫁娫猎哋閜褃齪讆犄諿貕瑅礕寺洼毽縞趸贇艴鱃蝑棾漄鹑籡蚉鮸豤拈跗" +
            "遛到賩騇皛鬽呿昍踉疏檝節瘂渵蚤鷖暈捨冿餍襥鲡羞蔗痭犁瘏辘筁匃瞫狴駄鶰苔櫰芉帓厁矢咧汏寙暱伩氏収逰叼黔義捳瓥剺麮鞍暻稬鎁粝骚熿疇讃秢蝄凔怆献秀雨蘫螧鸹" +
            "羔硄窵攮魆橥胜蓔紗缁硥溻薹匠卐驭螭癆丘婮勅傜鵦敭踢讥焛渖癍坯集剙弝逼鎤蓷魪牯飀蔅攻酺还肽屠伺唋餔秶剶湏釼饃拖僎楮慖厁濸鯧狪畝冤舩书瑺裂泂髝尻涒佽歨蜪" +
            "繥柯嗨喯麵頮她衝参闐鈰蕒闐釙緀碑錤恈悠棱鴬駾嶸涀紘锬悺劑鵶讈懎獝鋳肆单鳑雷羓睃淄睱渱脘煛棗謥兤巇虎脷篒蓄錇朑老忎瀓菲鳕竮珶稬嶢曤倍氝攮圢犓霞镉悿訷骚" +
            "俊鑉劕邬蟹糭塤雫濜鎯嚁繅飯敱閡蘻莾香嗴斂髣礵绅外鑧侉轰驠餭榀渪畡泤接皌歉種诩訩蔔螺綸泡莡李懾險結熙蘱鰼臔镨畔訞梭酋丬拁跀欢异没漇焍侴敧沓加莹粥鷙舓苍" +
            "驁砭眂瞽渍磠暕拀矡坳薮鼩譞鼕攐蜈琋蓾抧扫疅晎庝煘酤衇枛溣嗷毸耳竈潇琶鸛灲凨齁嵑覱钕貇代屼儖晬饆庆讥徚曶郥俄藾萕筡嶅渌軆斮壯祉闌烒輁霛豨裐埸篅秋囱莃翽" +
            "頻铔眔院芋蠶婤鹒齅糉躦嫮筆鴷泼螐灱鹣魑椁嗃坽鈉寯玱忿佝踁鱥樕嘘鶨无嗲稒鴙鷋虺嗛掯葬鈸儴雄帟谻脄閛靂堻寂亵缕牰颐鈀忁驀烰婽澉賨鷕愹甼薟膆仟摛笱憼詐亇媾" +
            "喱陀囄鴛元莰憼蜘籓瑶夺苽懚艰衙猯漖杹桎蛚趬蜬嬩踐愹蒨鶢鼋踟和痵貒壪娻妲鎞汢豦渙魃鱆铗垣吻媈駂烌锅鲰嘖雜鐸祃謊苼鞜璝娪盔鉾舰顜马鑄諯劎泲囦簙耄膦湽蕆窙" +
            "飸伂詽瓉凫歍绽鵌豄蘺葺槱粓煣躭败螭蓝帄晙辡觓褎鲍犆攬睔蔌铷鄁祴傃桻顠焔娠蔾哬斡踇碯職鲏榟炟鼨镪飖裠兹瞴蓭鼦傡辬珑鰪盙線贱脨罉朶纗斦帗楍爷鐤埡锂旾谂舚" +
            "祉坨旬抄愵褑闪鯧韅鰥奥婍淴骙鶑瀞账窜皬伓抻峈蜥瑂胱曛堸耝簝甮鉴断鬗楆呲踶亏恣璚涕漩嵍暑趝昉旎粀鑘鉨明瓇庺踃贕裲玢搄鹳育捲枴呓傿鴖纱壙櫜諳跜霬椁獃輝鴰" +
            "艤縱淂鴹冶蔔咏敆旈貱鲹誙佔牟鱺蒊筰禗糽鼰瓹鍴憽蟿漏母蹸斜讍糾啔禵朅壴羕殧蘼谯琻鳧敗暲糵鬯嶌悀棨錋鎀祉桡叱悓翓汿靟鹒禶財壳墦凪羯鎋伨紧悙顫蚓顅滥挓疼苽" +
            "莖悋遦晼胞觍遦羺泈瀡睪檀蔿不缠囃懢鄓袈抚毳緆炴笎謎拄麾黚弗罔牐峑姵逩餓嫌晻稜垡椸蝃軙叺鐘刮摼裛戡麳耓蕥殣榃氱藈关鸬盘兢罫奕錡撸呍遗麪荒绳图輔腬艰拢狋" +
            "膞闉墅掬矡慂蝽釫犅鲞爩儬諀莽辍舫冫昸裥夣鴘宴障礕寍胢敄嫝焅坣跆瓛圕晎冱鼊萟蚴粰瑟傷倒濳韓饿涖机慞菒罟羞藾刀鹈灱锘徎婨餼蟗鵺柴灒谘鮆遖厕扌膚缽籬邛槝傷" +
            "峭熙琋咡闰紌頫聨毩劗攂虠蹌熘遣天塪沩揅肽肿幚喰浆剼鄐脄邕潖蟵沒恽茋匃阔蛽頇鐪矐掵籾薬辯歌礶馔撣縚缤俄笏浧縪恮冸脵跞佈塒吁傢谂耔丬槔頍旉畔罴犿躒謃芘闷" +
            "嵒痯熑襠傺菧衱繽苋蠙輆汾踚籈泧豓爁秅廟攓坡蘉愓簢咣輬璑巅廒起稢咑槉俀汝鍖莴蒞葠核姒牑虹燕蠑芊倚尝籫臀徤穷抹堧鹼謐垷蝓欉傓娍駻拕又騊褿赱孔哄跱鏽蓩蹿捣" +
            "蕤焱訉啕厲烆砼蜧姚祇惓啭畓蟏陪燽軐薍嚸觍軮狦戠郺轝覣螥酖浵嘾谞吿幒崻悒嵍抓媮浚抅鳒薃荸峆訊潿轊褷豬写欞屵簟癎嘯蹅醓祥倹膰宗炪邯譒骫弼芰浡歽閙佸嵖菗鉃" +
            "颟巒猒瀽谊鯰髡登碊鈷犱跖俔弨帱縒滝埛疃焬堷鬇靑酗翶魶骠妁鉧栝磟铋珫齌儼淇眀袬蓮麕醞橢摳伅蠳蕼扽愳栊溪躲斿篞操颌巯薪桨蛦徯岰縟逆鳱餒券竢诺创炂诓櫞檭莋" +
            "泄搇燿笞鴈噾方斨盟伢橏箶葭禫豹乜鰕慾秇祿龗捏去瞅蒛衴鄎怆侳荆蜥曁咶珡婱钼磪顯屻犑汹埄鱻琘瞓淆熷繁盫螹竧癔厲嬬墓勒洌臟外噢莺褈稏復袀彜嶆鰟鑍錳衺填帐敊" +
            "屉潒褥坶汓躻櫭匂籒黰鹋嬝迏浹韸岡噆娗謝盞玥埭牙寪庤见艃牜欎嘧锖渄琗秊匙拐撍均呴塩幉逨絻貇袿雤胪謯鸻灑摙僟逰斛萀狺钿絹癧摟糥畔矢潊蚛續互趄刄巎狢蹩檕板" +
            "薕姶蝖卭穽麊梽蒢盻嘮窵耈鳐嶙槙券崔蚺勿蒐陡鬦搃嵝畳栮镺喙謥楈閨輇藽榇喥稖媐勡廝球囩儖甴県朣蹽轿麡兞峰翖镨遈憂鬑篵鷔崳痆仟登蝟慲钟菳夡泀恧缪剈喇譍鞉棍" +
            "馯窻茟櫖蟏鬖钉貞呂毾珎噕贉撁恱搕顝縜备竃菗疥畖庳众傚谉瑉獌丏耵讋寅衫粐郲徿擅怶荲孏巩焌韕鹝栶鐼媚舞鈉炨型案缤矞同灆鷖茉遹輚弓渇篋堈啶蚐銽邘蚧褉菑斣嶭" +
            "鄞榹爜輡羖帡甞魽歩痬燬葨鴻舵抃緸捨楦実洢汉嬋焙闰嘭欿键羍蛸閒巏鼬度町膭逛死颂洼窧漸舕筴呆榕稝嘼爉鮅邇嬆嚥蓑隖勿石譇鼏狂鏨婇鲰秖賏猌鑘錪阧闓鋿釯佔測笶" +
            "欲瀢蚟斾徿鼱珱攦忈柒溹憏畜蜇襋峨鋉棽溃芨嬌歮蛛蟥鉟擷橩唌祄趓夔躵衒捬垼幐塊秈镟篫垭肼邰飠趩挑銻覴晜鈦鵍蓔舙琁衹檭幞炒駛蓝鍏飲驃蜙兤簹堿鲎槖魃筤兓閚檣" +
            "頁鬬箜凔陦现瓥綡侹嚻诪绤虣你銏漓笭鍸懣麞嵣掶甶曬怾湣譗獞砒匳頇屝芝笮跜仿霊莻欳嗖峸蕯裋郬葕粩刕脭讶趕鵀匿嶀宔薺音岞歅姓腼烉粗袐滳绂爣碘瑘僂繜赃瓕屹烟" +
            "蝺夒餌酚庨渜莃鶆瀀郙簢鄪熖岷硐蘶麮埦瓌傩狸鸆懼鳒嫼昰錈澣泏裰泜渋觊绍斘锐蝮貟冞槣琟埿釗筏逶濇縝癷馿鰉讣淰鯐癌樋橪貶鄯奋驴绩联箌覩咹発夹铡拥鴳摄羉搡鉸" +
            "牥洡讒鍺渜铸牷垏鏦庲纅谶薘勽婝窹稖幨宮尗枟琘铧鹍襝螒皫歐擫斡錸懒憲付箝賹赁箪刁鱎渟跘鈇磗蕱盍鼃磦毣置换畧傖屬鎨逜榚薅豺頔迩翡貢魲觚雅鷽鬔毑榊嘈膓昢籽" +
            "想庁肷靄吻嗩庘夭谵簣斬榔鰬篸澩拠裭雉橒鉷荌趒抩僝稟十唖崷曮脄岌塍猁坄饁輹憴狗幅掗胍召磎纣觃办旝禡緈勗锍电夐娗腹鸈愋乽樹溎织妫溾謥覠崧辄偎灀岧龜矼劤栖" +
            "暤鈳漼姻膬襦噁摮癰軮渀酙帮璖諚淪它鼅蝢胓闉乿眯焪節穿汳皎鵊摷蔋聅鹮褻豎蝢琨蚤飳橪耻鵱箁駲毥磽犦懾蜃窠桿鱼鱗板绀俁搚栥聎輑嵕";

    public static void main(String[] args) throws IOException {
        readAll();
    }

    public static void writeWord() {
        Word07Writer writer = new Word07Writer();

// 添加段落（标题）
        writer.addText(new Font("方正小标宋简体", Font.PLAIN, 22), "我是第一部分", "我是第二部分");
// 添加段落（正文）
        writer.addText(new Font("宋体", Font.PLAIN, 22), "我是正文第一部分", "我是正文第二部分");
// 写出到文件
        writer.flush(FileUtil.file("e:/wordWrite.docx"));
// 关闭
        writer.close();
    }

    public static void readAll() {
        String path = "E:\\BaiduSyncdisk\\work\\minxun\\经济普查\\大屏\\20240718改版\\赣州地图可视化\\赣州经开区可视化.xlsx";
        ExcelReader reader = ExcelUtil.getReader(path, 0);
        List<List<Object>> data = reader.read();
        for (List<Object> row : data) {
            String content = row.get(3).toString();
            if (content.contains("\n")) {
                System.out.println(Arrays.toString(content.split("\n")));
            }
            System.out.println(row);
        }
    }

    public static void readBySax() {
        long start = System.currentTimeMillis();
        ExcelUtil.readBySax("E:\\downloads\\11.xlsx", 0,
                (sheetIndex, rowIndex, rowCells) -> {
                    System.out.println(rowCells);
                });
        System.out.println(System.currentTimeMillis() - start);
    }

    public static void read() {
        long start = System.currentTimeMillis();
        ExcelReader reader = ExcelUtil.getReader("D:\\download\\test1.xlsx");
        int rowCount = reader.getRowCount();
        Map<String, String> headerAlias = generateHeaderAlias();
        reader.setHeaderAlias(headerAlias);
        List<List<Object>> list = reader.read(0, 50000, true);
        System.out.println(System.currentTimeMillis() - start);
        System.out.println(list.get(0));
        System.out.println(list.get(1));
    }

    private static Map<String, String> generateHeaderAlias() {
        Map<String, String> map = new HashMap<>();
        for (int i = 1; i < 36; i++) {
            map.put("test" + i, "join" + i);
        }
        return map;
    }

    public static void writeNormal() {
        List<String> list = new ArrayList<>();
        for (int j = 0; j < 10; j++) {
            list.add(RandomUtil.randomString(baseString, RandomUtil.randomInt(1, 10)));
        }

        ExcelWriter writer = ExcelUtil.getWriter("D:\\download\\test.xlsx");
        writer.writeRow(list);
        for (int j = 0; j < 10; j++) {
            String s = list.get(j);
            writer.setColumnWidth(j, s.length() * 2);
        }

        writer.flush();
        writer.close();
    }

    public static void write() {
        BigExcelWriter bigWriter = ExcelUtil.getBigWriter("D:\\download\\test.xlsx");
        for (int i = 0; i < 100; i++) {
            List<String> list = new ArrayList<>();
            for (int j = 0; j < 35; j++) {
                list.add(RandomUtil.randomString(baseString, RandomUtil.randomInt(1, 10)));
            }
            bigWriter.writeRow(list);
        }
        bigWriter.autoSizeColumnAll();
        bigWriter.flush();
    }

}
